In [1]:
#Import Pandas to make datacleaning easier, deal with missing values and prepare the data
import pandas as pd

In [2]:
#Reading all datasets in 'Housing Prices' tab
all_homes = pd.read_csv('/Users/tanvidineshnandu/Desktop/md_data_folder/All_homes.csv')
one_bedroom = pd.read_csv('/Users/tanvidineshnandu/Desktop/md_data_folder/1_bedroom_homes.csv')
two_bedroom = pd.read_csv('/Users/tanvidineshnandu/Desktop/md_data_folder/2_bedroom_homes.csv')
three_bedroom = pd.read_csv('/Users/tanvidineshnandu/Desktop/md_data_folder/3_bedroom_homes.csv')
four_bedroom = pd.read_csv('/Users/tanvidineshnandu/Desktop/md_data_folder/4_bedroom_homes.csv')
five_bedroom = pd.read_csv('/Users/tanvidineshnandu/Desktop/md_data_folder/5_bedroom_homes.csv')
all_homes_forecast = pd.read_csv('/Users/tanvidineshnandu/Desktop/md_data_folder/forecasted_home_values.csv')
all_homes_observed_rent = pd.read_csv('/Users/tanvidineshnandu/Desktop/md_data_folder/All_homes_observed_rent.csv')

#Reading all datasets in 'Education' tab
high_school_df = pd.read_csv('/Users/tanvidineshnandu/Desktop/md_data_folder/high_school.csv')
library_df = pd.read_csv('/Users/tanvidineshnandu/Desktop/md_data_folder/library.csv') 

#Reading all datasets for Transportation
subway_df = pd.read_csv('/Users/tanvidineshnandu/Desktop/md_data_folder/subway_stations.csv')
borough_traffic_averages = pd.read_csv('/Users/tanvidineshnandu/Desktop/md_data_folder/traffic_volume.csv') 
demo_df = pd.read_csv('/Users/tanvidineshnandu/Desktop/md_data_folder/nyc_census_tracts.csv')

#Reading all datasets under 'Health and Environment' tab
parks_df = pd.read_csv('/Users/tanvidineshnandu/Desktop/md_data_folder/parks.csv')

#Reading the dataset for Hospitals
hospitals_df = pd.read_csv('/Users/tanvidineshnandu/Desktop/md_data_folder/Hospitals.csv')

#Reading all datasets in 'Entertainment and Recreation tab'
restaurants_df = pd.read_csv('/Users/tanvidineshnandu/Desktop/md_data_folder/restaurants.csv')
swimmingpool_df = pd.read_csv('/Users/tanvidineshnandu/Desktop/md_data_folder/swimmingpool.csv')
museum_df = pd.read_csv('/Users/tanvidineshnandu/Desktop/md_data_folder/museums.csv')
markets_df = pd.read_csv('/Users/tanvidineshnandu/Desktop/md_data_folder/markets.csv')
theatres_df = pd.read_csv('/Users/tanvidineshnandu/Desktop/md_data_folder/theatres.csv')
beaches_df = pd.read_csv('/Users/tanvidineshnandu/Desktop/md_data_folder/beaches.csv')
athleticfacilities_df = pd.read_csv('/Users/tanvidineshnandu/Desktop/md_data_folder/athletics.csv')

#Reading all datasets in 'Utilities' tab
electricity_df = pd.read_csv('/Users/tanvidineshnandu/Desktop/md_data_folder/ElectricCost.csv')
firehouselocations_df = pd.read_csv('/Users/tanvidineshnandu/Desktop/md_data_folder/firehouselocations.csv')
cookinggas_df = pd.read_csv('/Users/tanvidineshnandu/Desktop/md_data_folder/cookinggas.csv')
wifi_hotspot_df = pd.read_csv('/Users/tanvidineshnandu/Desktop/md_data_folder/Wifihotspot.csv')
grocery_stores = pd.read_csv('/Users/tanvidineshnandu/Desktop/md_data_folder/grocery_stores.csv')

#Reading all datasets in 'Upcoming Projects' tab
projects_under_constr_df = pd.read_csv('/Users/tanvidineshnandu/Desktop/md_data_folder/projects_under_constr.csv')

#Reading all datasets in 'Location Data' tab
nyc_zip_borough_df = pd.read_csv('/Users/tanvidineshnandu/Desktop/md_data_folder/nyc_zip-borough.csv')
borough_master_df = pd.read_csv('/Users/tanvidineshnandu/Desktop/md_data_folder/borough_master_db.csv')

/var/folders/5y/spsyg6_d2nd8f42x3pkg_vv00000gn/T/ipykernel_86976/210375984.py:36: DtypeWarning: Columns (17) have mixed types. Specify dtype option on import or set low_memory=False.
  electricity_df = pd.read_csv('/Users/tanvidineshnandu/Desktop/md_data_folder/ElectricCost.csv')
/var/folders/5y/spsyg6_d2nd8f42x3pkg_vv00000gn/T/ipykernel_86976/210375984.py:38: DtypeWarning: Columns (7) have mixed types. Specify dtype option on import or set low_memory=False.
  cookinggas_df = pd.read_csv('/Users/tanvidineshnandu/Desktop/md_data_folder/cookinggas.csv')

## Connecting to SQL - postgress (db name : 'nyc_projectmd')

In [3]:
import pandas as pd
from sqlalchemy import create_engine, text

# Database connection URL
DATABASE_URL = "postgresql://postgres:123@localhost:5432/nyc_projectmd"
engine = create_engine(DATABASE_URL)

### Demographics' datasets

In [4]:
#Reading the demographics directly here and then loading it onto SQL first and then transforming it
file_path1 = '/Users/tanvidineshnandu/Desktop/md_data_folder/nyc_census_tracts.csv'
data = pd.read_csv(file_path1) 

print(data.head())
data.fillna(0, inplace=True)

#Extract the unique list of boroughs from the 'data' DataFrame and remove duplicates.
boroughs_data = data[['Borough']].drop_duplicates()

#Aggregate demographic data by borough. Calculate the total population, total number of men, and total number of women.
demographics_agg = data.groupby('Borough').agg(TotalPop=('TotalPop', 'sum'),
                                               Men=('Men', 'sum'),
                                               Women=('Women', 'sum')).reset_index()

#Aggregate race and ethnicity data by borough
race_ethnicity_agg = data.groupby('Borough').agg(TotalHispanic=('Hispanic', 'sum'),
                                                 TotalWhite=('White', 'sum'),
                                                 TotalBlack=('Black', 'sum'),
                                                 TotalNative=('Native', 'sum'),
                                                 TotalAsian=('Asian', 'sum')).reset_index()

#Aggregate economic indicators by borough
economic_indicators_agg = data.groupby('Borough').agg(AvgIncome=('Income', 'mean'),
                                                      TotalEmployed=('Employed', 'sum'),
                                                      TotalUnemployed=('Unemployment', 'sum')).reset_index()

# Round the AvgIncome in the economic_indicators_agg DataFrame to one decimal place
economic_indicators_agg['AvgIncome'] = economic_indicators_agg['AvgIncome'].round(1)

# After rounding
print(economic_indicators_agg['AvgIncome'].head())

   CensusTract County Borough  TotalPop   Men  Women  Hispanic  White  Black  \
0  36005000100  Bronx   Bronx      7703  7133    570      29.9    6.1   60.9
1  36005000200  Bronx   Bronx      5403  2659   2744      75.8    2.3   16.0
2  36005000400  Bronx   Bronx      5915  2896   3019      62.7    3.6   30.7
3  36005001600  Bronx   Bronx      5879  2558   3321      65.1    1.6   32.4
4  36005001900  Bronx   Bronx      2591  1206   1385      55.4    9.0   29.0

   Native  ...  Walk  OtherTransp  WorkAtHome  MeanCommute  Employed  \
0     0.2  ...   NaN          NaN         NaN          NaN         0
1     0.0  ...   2.9          0.0         0.0         43.0      2308
2     0.0  ...   1.4          0.5         2.1         45.0      2675
3     0.0  ...   8.6          1.6         1.7         38.8      2120
4     0.0  ...   3.0          2.4         6.2         45.4      1083

   PrivateWork  PublicWork  SelfEmployed  FamilyWork  Unemployment
0          NaN         NaN           NaN         NaN           NaN
1         80.8        16.2           2.9         0.0           7.7
2         71.7        25.3           2.5         0.6           9.5
3         75.0        21.3           3.8         0.0           8.7
4         76.8        15.5           7.7         0.0          19.2

[5 rows x 36 columns]
0    38151.6
1    53337.9
2    79589.5
3    59821.0
4    70057.0
Name: AvgIncome, dtype: float64

### 'Crime Stats'

In [5]:
#Reading and inserting 'crime data files' directly on SQL and transforming them
import pandas as pd
from sqlalchemy import create_engine, text

# Database connection URL
DATABASE_URL = "postgresql://postgres:123@localhost:5432/nyc_projectmd"
engine = create_engine(DATABASE_URL)

#Our crime data had precinct numbers, but not zipcodes; 
#so we connected it with the precinct data (parking lot data) which had both zipcodes and boroughs

# Read and insert latitude and longitude data -- this is required for mapping it on the heat map
file_path_lat_long = '/Users/tanvidineshnandu/Desktop/md_data_folder/us_lat_long.csv'
data_lat_long = pd.read_csv(file_path_lat_long)
data_lat_long.columns = ['zipcode', 'latitude', 'longitude']  # Ensure column names are lowercase
data_lat_long.to_sql('lat_long', con=engine, if_exists='replace', index=False)

# Read and insert precinct data 
file_path_precinct = '/Users/tanvidineshnandu/Desktop/md_data_folder/DPR_ParkingLots_001_20240325.csv'
data_precinct = pd.read_csv(file_path_precinct, usecols=['PRECINCT', 'ZIPCODE', 'BOROUGH'])
data_precinct.columns = ['precinct', 'zipcode', 'borough']  # Ensure column names are lowercase
data_precinct.to_sql('precinct', con=engine, if_exists='replace', index=False)

# Read crime data, melt it, and insert
file_path_crime = '/Users/tanvidineshnandu/Desktop/md_data_folder/crimedata.csv'
data_crime = pd.read_csv(file_path_crime)
df_melted = data_crime.melt(id_vars=["PCT", "CRIME"], var_name="YEAR", value_name="DATA")
df_melted.columns = ['pct', 'crime', 'year', 'data']  # Ensure column names are lowercase
df_melted.to_sql('crime_data', con=engine, if_exists='replace', index=False)

140

In [6]:
#Reading and inserting crime data files directly on SQL and transforming them
with engine.connect() as conn:
    conn.execute(text("""
        CREATE TABLE IF NOT EXISTS crime_statistics AS
        SELECT
            c.pct,
            c.crime,
            c.year,
            c.data,
            p.zipcode,
            p.borough
        FROM
            crime_data c
        JOIN
            precinct p ON c.pct = p.precinct;
    """))

    # Doing Borough Mapping to Update borough names
    borough_updates = {
        "X": "The Bronx",
        "B": "Brooklyn",
        "M": "Manhattan",
        "Q": "Queens",
        "R": "Staten Island"
    }

    for key, value in borough_updates.items():
        conn.execute(text("UPDATE crime_statistics SET borough = :borough WHERE borough = :key;"), {"borough": value, "key": key})

# Normalize zipcodes
with engine.begin() as conn:
    df = pd.read_sql("SELECT * FROM crime_statistics;", con=conn)
    df_normalized = df.drop('zipcode', axis=1).join(
        df['zipcode'].str.split(',', expand=True).stack().reset_index(level=1, drop=True).rename('zipcode')
    )
    df_normalized.to_sql('crime_statistics_expanded', con=engine, if_exists='replace', index=False)

    # Create a new table to store aggregated data
    conn.execute(text("""
        CREATE TABLE IF NOT EXISTS final_crime_statistics (
            zipcode VARCHAR(10),
            average_crime_data FLOAT,
            borough VARCHAR(255)
        );
    """))

    # Insert aggregated data into the new table
    conn.execute(text("""
        INSERT INTO final_crime_statistics (zipcode, average_crime_data, borough)
        SELECT
            zipcode,
            ROUND(AVG(data)::numeric, 1) AS average_crime_data,
            MAX(borough) AS borough
        FROM
            crime_statistics_expanded
        GROUP BY
            zipcode;
    """))

# Display the final query result from the aggregated data table
df_final = pd.read_sql("SELECT * FROM final_crime_statistics ORDER BY zipcode ASC;", con=engine)

df_final #our final crime data - which we will plot on the heatmap

    zipcode  average_crime_data    borough
0     10004               505.0  Manhattan
1     10004               505.0  Manhattan
2     10004               505.0  Manhattan
3     10004               505.0  Manhattan
4     10004               505.0  Manhattan
..      ...                 ...        ...
843   11693               150.4     Queens
844   11693               150.4     Queens
845   11693               150.4     Queens
846   11693               150.4     Queens
847   11693               150.4     Queens

[848 rows x 3 columns]

### Education Data

In [7]:
#Cleaning 'high_school' data file, creating SQL Table wrapped in text
import pandas as pd
from sqlalchemy import create_engine, text

# Ensure the 'Borough' column is in title case
high_school_df['Borough'] = high_school_df['Borough'].str.title()

# Connection string to connect to PostgreSQL
db_connection_url = 'postgresql://postgres:123@localhost:5432/nyc_projectmd'
engine = create_engine(db_connection_url)

# SQL statement to create the high_schools table, wrapped in text()
create_table_stmt = text("""
CREATE TABLE IF NOT EXISTS high_schools (
    zip_code VARCHAR(255) NOT NULL,
    borough VARCHAR(255) NOT NULL,
    school_name VARCHAR(255) NOT NULL,
    school_id SERIAL PRIMARY KEY);
""")

# Execute the statement to create the table if it doesn't exist
with engine.connect() as connection:
    connection.execute(create_table_stmt)
    
# Select and rename columns from the DataFrame
high_schools = high_school_df[['postcode', 'school_name', 'Borough']].drop_duplicates()
high_schools.columns = ['zip_code', 'school_name', 'borough']
high_schools.head

<bound method NDFrame.head of      zip_code                                        school_name    borough
0       10467  Bronx High School for Writing and Communicatio...      Bronx
1       10023  The Maxine Greene High School for Imaginative ...  Manhattan
2       11420                           Epic High School - South     Queens
3       10457                        Eagle Academy for Young Men      Bronx
4       10040                                The College Academy  Manhattan
..        ...                                                ...        ...
422     10460               Fannie Lou Hamer Freedom High School      Bronx
423     11201                 Brooklyn International High School   Brooklyn
424     11691  Academy of Medical Technology: A College Board...     Queens
425     11206                          The Brooklyn Latin School   Brooklyn
426     10034          High School for Excellence and Innovation  Manhattan

[427 rows x 3 columns]>

In [8]:
#Working on Data Cleaning the 'library_df'
import pandas as pd
from sqlalchemy import create_engine, text
from sqlalchemy import inspect  # Import the inspect module

# Define the mapping of BOROCODE to borough names
borough_map = {
    1: 'Manhattan',
    2: 'Bronx',
    3: 'Brooklyn',
    4: 'Queens',
    5: 'Staten Island'
}

# Map BOROCODE to borough names and create a new 'borough' column
library_df['borough'] = library_df['BOROCODE'].map(borough_map)

# Connection string to your PostgreSQL database
db_connection_url = 'postgresql://postgres:123@localhost:5432/nyc_projectmd'

# Create an engine that connects to the PostgreSQL server
engine = create_engine(db_connection_url)

# Check if the 'library' table exists, and if not, create it
inspector = inspect(engine)  # Create an inspector object

# SQL statement to create the library table, wrapped in text()
create_table_stmt = text("""
    CREATE TABLE IF NOT EXISTS library (
        library_id SERIAL PRIMARY KEY,
        name VARCHAR(255) NOT NULL,
        zip VARCHAR(10) NOT NULL,
        borough VARCHAR(255) NOT NULL
    );
""")

# Execute the statement to create the table if it doesn't exist
with engine.connect() as connection:
    connection.execute(create_table_stmt)

# Prepare the DataFrame for insertion
# Keep only necessary columns and ensure no duplicates
library_df = library_df[['NAME', 'ZIP', 'borough']].drop_duplicates()

# Rename columns to match the SQL table definition
library_df.columns = ['name', 'zip', 'borough'] 
library_df.head

<bound method NDFrame.head of              name    zip    borough
0    115th Street  10026  Manhattan
1    125th Street  10035  Manhattan
2     53rd Street  10019  Manhattan
3     58th Street  10022  Manhattan
4     67th Street  10065  Manhattan
..            ...    ...        ...
211     Sunnyside  11104     Queens
212    Whitestone  11357     Queens
213  Windsor Park  11364     Queens
214     Woodhaven  11421     Queens
215      Woodside  11377     Queens

[216 rows x 3 columns]>

### Transportation Data

In [9]:
#Subway Stations - Clean the data, prepare as needed, create table. 

# Map borough abbreviations to full names
borough_map = {
    'Q': 'Queens',
    'M': 'Manhattan',
    'Bk': 'Brooklyn',
    'Bx': 'Bronx',
    'S': 'Staten Island'
}
subway_df['Borough'] = subway_df['Borough'].map(borough_map)

# Select and rename the required columns
subway_df = subway_df[['Borough', 'Stop Name', 'Line', 'ADA']].copy()
subway_df.columns = ['borough', 'station_name', 'line', 'ada_accessible']

# Convert 'ada_accessible' from integers to boolean
subway_df['ada_accessible'] = subway_df['ada_accessible'].astype(bool)

# Connection string to your PostgreSQL database
db_connection_url = 'postgresql://postgres:123@localhost:5432/nyc_projectmd' 

# Create an engine that connects to the PostgreSQL server
engine = create_engine(db_connection_url)

# Prepare the SQL statement for creating the table 
create_table_stmt = """
    CREATE TABLE IF NOT EXISTS subway_stations (
        id SERIAL PRIMARY KEY,
        borough VARCHAR(255),
        station_name VARCHAR(255) NOT NULL,
        line VARCHAR(255),
        ada_accessible BOOLEAN
    );
    """

# Execute the create table statement
engine.execute(create_table_stmt)

In [10]:
#New York's Transportation Data - Clean the data, prepare as needed, create table. 

import pandas as pd
from sqlalchemy import create_engine

# Assuming 'Borough' contains full names, select transportation-related columns
transportation_cols = ['Borough', 'Drive', 'Carpool', 'Transit', 'Walk', 'OtherTransp', 'WorkAtHome', 'MeanCommute']

# Filter the dataframe to include only transportation-related columns
transportation_df = demo_df[transportation_cols].copy()

# Group by 'Borough' and calculate the mean for each transportation-related column
borough_transportation = transportation_df.groupby('Borough', as_index=False).mean()

# Rename columns to match your database schema, if necessary
borough_transportation.columns = ['borough', 'drive', 'carpool', 'transit', 'walk', 'other_transp', 'work_at_home', 'mean_commute']

# Connection string to your PostgreSQL database
db_connection_url = 'postgresql://postgres:123@localhost:5432/nyc_projectmd'

# Create an engine that connects to the PostgreSQL server
engine = create_engine(db_connection_url)

# Prepare the SQL statement for creating the table 
create_table_stmt = """
    CREATE TABLE IF NOT EXISTS nyc_borough_transportation (
        id SERIAL PRIMARY KEY,
        borough VARCHAR(255),
        drive NUMERIC,
        carpool NUMERIC,
        transit NUMERIC,
        walk NUMERIC,
        other_transp NUMERIC,
        work_at_home NUMERIC,
        mean_commute NUMERIC
    );
    """

# Execute the create table statement
engine.execute(create_table_stmt)

In [11]:
#Working on the NY's traffic data - borough_traffic_averages - data cleaning and transformation

import pandas as pd
from sqlalchemy import create_engine

# Ensure that the column names are correct
print(borough_traffic_averages.columns)

# Combine year, month, day, hour, and minute into a datetime column
# Use the format parameter to specify the format of our datetime columns
borough_traffic_averages['datetime'] = pd.to_datetime(borough_traffic_averages['Yr'].astype(str) + '-' + borough_traffic_averages['M'].astype(str) + '-' + 
                                borough_traffic_averages['D'].astype(str) + ' ' + borough_traffic_averages['HH'].astype(str) + ':' + 
                                borough_traffic_averages['MM'].astype(str), format='%Y-%m-%d %H:%M')

# Set the 'datetime' column as the DataFrame index
borough_traffic_averages.set_index('datetime', inplace=True)

# Group the data by borough and resample to get daily averages
daily_avg = borough_traffic_averages.groupby('Boro').resample('D')['Vol'].mean().reset_index(name='daily_avg')

# Calculate the overall average for each borough
borough_daily_avg = daily_avg.groupby('Boro')['daily_avg'].mean().reset_index()

# Rename the columns as per the schema of the database table
borough_daily_avg.columns = ['borough', 'daily_traffic_volume_avg']

# Connection string to your PostgreSQL database
db_connection_url = 'postgresql://postgres:123@localhost:5432/nyc_projectmd' 

# Create an engine that connects to the PostgreSQL server
engine = create_engine(db_connection_url)

# SQL statement for creating the table 
create_table_stmt = """
CREATE TABLE IF NOT EXISTS borough_traffic_averages (
    id SERIAL PRIMARY KEY,
    borough VARCHAR(255),
    daily_traffic_volume_avg NUMERIC
);
"""

# Execute the create table statement
engine.execute(create_table_stmt)

# Insert the aggregated DataFrame into the PostgreSQL table
borough_daily_avg.to_sql(name='borough_traffic_averages', con=engine, if_exists='append', index=False)

Index(['RequestID', 'Boro', 'Yr', 'M', 'D', 'HH', 'MM', 'Vol', 'SegmentID',
       'WktGeom', 'street', 'fromSt', 'toSt', 'Direction'],
      dtype='object')

5

### Hospital dataset

In [12]:
print(hospitals_df.columns)

#Drop columns that we dont need
columns_to_drop = ['Cross Streets', 'Phone', 'Location 1']
hospitals_df.drop(columns=columns_to_drop, inplace=True)

hospitals_df

# Drop duplicate rows based on 'Facility Type' and 'Facility Name'
print("Number of duplicate rows before dropping:", restaurants_df.shape[0])
hospitals_df = hospitals_df.drop_duplicates(subset=['Facility Type', 'Facility Name', 'Borough'])
print("Number of duplicate rows dropped =", hospitals_df.shape[0])

#Checking for null values
null_values = hospitals_df.isnull().sum()
print(null_values)

print(hospitals_df.head)

Index(['Facility Type', 'Borough', 'Facility Name', 'Cross Streets', 'Phone',
       'Location 1'],
      dtype='object')
Number of duplicate rows before dropping: 670
Number of duplicate rows dropped = 78
Facility Type    0
Borough          0
Facility Name    0
dtype: int64
<bound method NDFrame.head of           Facility Type    Borough                             Facility Name
0   Child Health Center  Manhattan                     La Clinica Del Barrio
1   Acute Care Hospital     Queens                  Elmhurst Hospital Center
2   Child Health Center   Brooklyn     Ida G. Israel Community Health Center
3   Child Health Center     Queens      South Queens Community Health Center
4   Child Health Center      Bronx        Melrose Houses Child Health Clinic
..                  ...        ...                                       ...
73  Child Health Center   Brooklyn          Bushwick Community Health Center
74  Child Health Center  Manhattan                  Bellevue Hospital Center
75  Child Health Center     Queens              Ridgewood Communicare Clinic
76  Child Health Center  Manhattan           Smith Communicare Health Center
77  Child Health Center      Bronx  Morrisania Diagnostic & Treatment Center

[78 rows x 3 columns]>

### 'Parks'

In [13]:
parks_df.head()

#check Null Values
null_percent= parks_df.isnull().sum()/len(parks_df)
null_percent

#Drop columns that were null based on the % we got above
columns_to_drop= null_percent[null_percent>=0.7].index

parks_df_cleaned = parks_df.drop(columns=columns_to_drop)


#dimension of the dataframe
parks_df_cleaned.shape

parks_df_cleaned.head()

#BOROUGH MAPPING
parks_df_cleaned['BOROUGH'].value_counts()
parks_df_cleaned.columns= [col.lower() for col in parks_df_cleaned.columns]
borough_mapping = {
    'B': 'Brooklyn', 
    'Q': 'Queens', 
    'X': 'Bronx', 
    'M': 'Manhattan', 
    'R': 'Staten Island'}

parks_df_cleaned['borough'] = parks_df_cleaned['borough'].map(borough_mapping)

parks_df_cleaned.head()

parks_df_cleaned['borough'].value_counts()

#zipcodes' column needed to be filtered using regex, and a new zipcode column is created
import numpy as np
zip_code_regex = r'^\d{5}(-\d{4})?$'


# Replace entries that don't match the zip code pattern with NaN
parks_df_cleaned['zipcode'] = np.where(parks_df_cleaned['zipcode'].str.match(zip_code_regex), parks_df_cleaned['zipcode'], np.nan)
parks_df_cleaned.columns

#typecasting
parks_df_cleaned['zipcode']= parks_df_cleaned['zipcode'].astype(str).str[:5]

#dropped irrelevant columns that are not needed in visualization 
parks_df_cleaned = parks_df_cleaned.drop(['acquisitiondate','gispropnum', 'globalid', 'jurisdiction', 'location', 'mapped',
       'name311', 'nys_assembly', 'nys_senate', 'objectid', 'omppropid', 'eapply', 'gisobjid',
       'parentid', 'permit', 'permitdistrict', 'permitparent', 'pip_ratable',
       'precinct', 'retired', 'signname', 'subcategory', 'typecategory', 'url',
       'us_congress', 'waterfront'], axis=1)


#Data Cleaning 
final_parks=parks_df_cleaned.drop(['communityboard','councildistrict','department','multipolygon'],axis=1)

final_parks.columns

final_parks['zipcode'].replace("nan",None,inplace=True)

final_parks['class']='PARK'

final_parks['acres'] = final_parks['acres'].astype(str)


final_parks.dropna(inplace=True)

def cleaning_data(x):
    if len(x)>40:
        return None
    else:
        return x
    
final_parks.head()

final_parks['acres']= final_parks['acres'].apply(cleaning_data)

final_parks.tail()

       acres              address    borough class zipcode
2039    1.19   4802 TILDEN AVENUE   Brooklyn  PARK   11203
2040  20.132  570 WEST 214 STREET  Manhattan  PARK   10034
2041    0.98    204-08 203 STREET     Queens  PARK   11412
2045     6.1   200 CITY ISLAND AV      Bronx  PARK   10464
2046  20.867  665 WEST 252 STREET      Bronx  PARK   10471

### 'Housing Prices Data'

In [14]:
all_homes.head()
# Checking number of rows in allb 
len(all_homes),len(one_bedroom), len(two_bedroom), len(three_bedroom), len(four_bedroom), len(five_bedroom)


#selecting required columns
columns_to_select = ['RegionName', 'State', 'City', 'CountyName', 'Bedrooms',
                     '2/29/24', '1/31/24', '12/31/23',
                     '11/30/23', '10/31/23', '9/30/23']


one_bedroom_final = one_bedroom[columns_to_select]
two_bedroom_final = two_bedroom[columns_to_select]
three_bedroom_final = three_bedroom[columns_to_select]
four_bedroom_final = four_bedroom[columns_to_select]
five_bedroom_final = five_bedroom[columns_to_select]

#Had to use different column names for this dataframe only since column names were different
all_homes_final = all_homes[['RegionName', 'State', 'City', 'CountyName',
                     '2024-02-29', '2024-01-31', '2023-12-31',
                     '2023-11-30', '2023-10-31', '2023-09-30']]



#Renaming columns
one_bedroom_final = one_bedroom_final.rename(columns={'RegionName': 'Zipcode'})
two_bedroom_final = two_bedroom_final.rename(columns={'RegionName': 'Zipcode'})
three_bedroom_final = three_bedroom_final.rename(columns={'RegionName': 'Zipcode'})
four_bedroom_final = four_bedroom_final.rename(columns={'RegionName': 'Zipcode'})
five_bedroom_final = five_bedroom_final.rename(columns={'RegionName': 'Zipcode'})
all_homes_final = all_homes_final.rename(columns={'RegionName': 'Zipcode', '2024-02-29':'2/29/24',
                                                 '2024-01-31': '1/31/24', '2023-12-31': '12/31/23',
                                                 '2023-11-30': '11/30/23', '2023-10-31': '10/31/23',
                                                 '2023-09-30': '9/30/23'})

print(one_bedroom_final.head())

   Zipcode State         City          CountyName  Bedrooms      2/29/24  \
0     8701    NJ     Lakewood        Ocean County         1  147211.5873
1    11368    NY     New York       Queens County         1  295613.6493
2    77084    TX      Houston       Harris County         1  110530.4080
3    11385    NY     New York       Queens County         1  518884.6461
4    90011    CA  Los Angeles  Los Angeles County         1  460339.2929

       1/31/24     12/31/23     11/30/23     10/31/23      9/30/23
0  145761.3242  143710.5982  141378.1497  139274.8913  137655.5525
1  296021.0357  297250.8751  299181.4487  299777.6779  297951.2679
2  111361.6061  111909.7233  112663.5152  113229.4815  113294.4901
3  520898.9310  520370.0988  521372.5027  522187.8711  525545.8851
4  466610.4360  468951.2469  467966.2946  465212.3014  462102.1029

In [15]:
#Merging the 5 tables (one_bedroom, two_bedroom, etc....) into one table; all tables except all_homes_final
all_homes_by_bedrooms = pd.concat([one_bedroom_final, two_bedroom_final,
                                   three_bedroom_final, four_bedroom_final, five_bedroom_final],
                                  ignore_index=True)

# Checking to ensure all values were included
len(one_bedroom) + len(two_bedroom) + len(three_bedroom) + len(four_bedroom) + len(five_bedroom) == len(all_homes_by_bedrooms)

#Number of missing values by column
all_homes_by_bedrooms.isna().sum()

all_homes_final.isna().sum()

# Filtering for NY zipcodes only
all_homes_by_bedrooms = all_homes_by_bedrooms[all_homes_by_bedrooms['State'] == 'NY']
all_homes_final = all_homes_final[['Zipcode','2/29/24', '1/31/24', '12/31/23','11/30/23', '10/31/23', '9/30/23']]

# Imputing value of 0 for all missing values
all_homes_by_bedrooms.fillna(0, inplace=True)
all_homes_final.fillna(0, inplace=True)

#Changing column name to date data type for using in graphs
new_column_names = []
for col in all_homes_by_bedrooms.columns:
    try:
        # Convert to datetime
        col_as_datetime = pd.to_datetime(col)
        # Format to "YYYY-MM" and append to new column names list
        new_column_names.append(col_as_datetime.strftime('%Y-%m'))
    except ValueError:
        # If conversion fails, keep the original column name
        new_column_names.append(col)

# Assign the new column names back to the DataFrame
all_homes_by_bedrooms.columns = new_column_names

# Display the DataFrame to verify the change
print(all_homes_by_bedrooms.columns)



new_column_names = []
for col in all_homes_final.columns:
    try:
        # Convert to datetime
        col_as_datetime = pd.to_datetime(col)
        # Format to "YYYY-MM" and append to new column names list
        new_column_names.append(col_as_datetime.strftime('%Y-%m'))
    except ValueError:
        # If conversion fails, keep the original column name
        new_column_names.append(col)

# Assign the new column names back to the DataFrame
all_homes_final.columns = new_column_names

# Display the DataFrame to verify the change
print(all_homes_final.columns)

Index(['Zipcode', 'State', 'City', 'CountyName', 'Bedrooms', '2024-02',
       '2024-01', '2023-12', '2023-11', '2023-10', '2023-09'],
      dtype='object')
Index(['Zipcode', '2024-02', '2024-01', '2023-12', '2023-11', '2023-10',
       '2023-09'],
      dtype='object')

In [16]:
# Implementing same steps as above for forecasted house prices dataset - Importing dataset
all_homes_forecast.head()
#
#Selecting relevant columns
all_homes_forecast = all_homes_forecast[['RegionName', 'State','BaseDate',
                                          '2024-03-31', '2024-05-31', '2025-02-28']]

#renaming Columns
all_homes_forecast = all_homes_forecast.rename(columns={'RegionName': 'zipcode', 'BaseDate': 'basedate', '2024-03-31':'2024-03',
                                                 '2024-05-31': '2024-05', '2025-02-28': '2025-02'})

#Filtering for NY Zip Codes 
all_homes_forecast = all_homes_forecast[all_homes_forecast['State'] == 'NY']

all_homes_forecast

#Checking missing values
all_homes_forecast.isna().sum()

#Changing data type of BaseDate column to data
all_homes_forecast.dtypes

#changing structure of basedate for a better format
all_homes_forecast['basedate'] = pd.to_datetime(all_homes_forecast['basedate']).dt.strftime('%m-%d-%Y')

all_homes_forecast

#Selecting only relevant columns
all_homes_forecast = all_homes_forecast[['zipcode','basedate',
                                          '2024-03', '2024-05', '2025-02']]

In [17]:
#Repeating process for All_homes_observed_rent
all_homes_observed_rent.columns

#Filter for NY data
all_homes_observed_rent = all_homes_observed_rent[all_homes_observed_rent['State'] == 'NY']

all_homes_observed_rent.head()

#keeping only relevant columns
all_homes_observed_rent = all_homes_observed_rent[['RegionName',
                                               '2024-02-29', '2024-01-31', '2023-12-31',
                                               '2023-11-30', '2023-10-31', '2023-09-30']]

#Renaming Columns
all_homes_observed_rent.columns = ['zipcode','2024-02','2024-01', '2023-12', '2023-11','2023-10','2023-09' ]

#imputing value of 0 for missing data
all_homes_observed_rent.fillna(0, inplace=True)
all_homes_observed_rent.head

<bound method NDFrame.head of       zipcode        2024-02       2024-01       2023-12       2023-11  \
4       11385    2927.157063   2901.151309   2866.434699   2843.439019
6       11208    2677.507937   2676.152092   2647.161027   2634.880571
13      11236    2624.333333   2527.692271   2438.186951   2430.381784
14      10467    2049.541667   2063.901324   2038.555373   2045.855582
15      11373    2644.183333   2634.409904   2635.389306   2617.415381
...       ...            ...           ...           ...           ...
6653    11932   57708.291667  56791.814849      0.000000      0.000000
6654    11930   74222.200000  76711.380698  70816.986151  67210.135393
6656    11959   50000.000000  44893.801851      0.000000      0.000000
6657    11962  106250.000000  98928.753262      0.000000      0.000000
6663    10004    4781.527778   4734.681086   4730.962801   4703.536465

           2023-10       2023-09
4      2821.722613   2818.173612
6      2564.938472   2545.574934
13     2378.784781   2346.971466
14     1982.157742   1927.609073
15     2623.307388   2597.244253
...            ...           ...
6653      0.000000      0.000000
6654  65200.967242  71659.738593
6656      0.000000      0.000000
6657      0.000000      0.000000
6663   4693.885823   4600.877285

[308 rows x 7 columns]>

### 'Location Data'

In [18]:
# Cleaning the Location Data

#Check the data for usa's zip to borough dataset for null values, clean if needed. 
null_values = nyc_zip_borough_df.isnull().sum()
null_values

nyc_zip_borough_df

#Renaming the 'measurement' column to 'zipcode'
nyc_zip_borough_df = nyc_zip_borough_df.rename(columns={'measurement': 'zipcode'})

#Dropping the 'neighborhood' column
nyc_zip_borough_df = nyc_zip_borough_df.drop(columns=['Neighborhood'])

#Verify the changes
print(nyc_zip_borough_df.columns)

#renaming columns wherver needed to make merge process easier 
nyc_zip_borough_df = nyc_zip_borough_df.rename(columns={'Borough': 'borough'})

#left join the nyc_zip_borough_df to the borough_master_df and call it borough_zip
borough_zip = pd.merge(nyc_zip_borough_df, borough_master_df, on='borough', how='left')
borough_zip

Index(['Borough', 'zipcode'], dtype='object')

    borough  zipcode  borough_id
0     Bronx    10453         2.0
1     Bronx    10458         2.0
2     Bronx    10451         2.0
3     Bronx    10454         2.0
4     Bronx    10463         2.0
..      ...      ...         ...
173  Queens    11420         4.0
174  Queens    11378         4.0
175  Queens    11428         4.0
176  Queens    11421         4.0
177  Queens    11429         4.0

[178 rows x 3 columns]

### Entertainmnet and Recreation data

In [19]:
#Check the restaurant dataset for null values, clean if needed. 
restaurants_df.head

#View what all columns have null values 
null_values = restaurants_df.isnull().sum()
null_values

#Out of all the columns with Null Values, we will only need the 'Rating' column in the final dashboard, so drop the rows with Null values in Ratings
restaurants_df.dropna(subset=['Rating'], inplace=True)

#Dropping Columns that are not needed for visualization
columns_to_drop = ['URL', 'Rating Count', 'Detailed Ratings', 'Price Category', 'Address', 'Lat', 'Lon']
restaurants_df.drop(columns=columns_to_drop, inplace=True)


# Drop duplicate rows based on 'Name' and 'ZipCode'
print("Number of duplicate rows before dropping:", restaurants_df.shape[0])
restaurants_df = restaurants_df.drop_duplicates(subset=['Name', 'ZipCode'])
print("Number of duplicate rows dropped =", restaurants_df.shape[0])

Number of duplicate rows before dropping: 666
Number of duplicate rows dropped = 663

In [20]:
#Check the swimming pools dataset for null values, clean if needed. 
swimmingpool_df.columns

#Dropping Columns that are not needed for visualization
columns_to_drop_pools = ['the_geom', 'OBJECTID', 'LOCATION', 'GISPROPNUM', 'COUNCILDIS', 'POOLTYPE', 'SHAPE_STAr', 'SHAPE_STLe']
swimmingpool_df.drop(columns=columns_to_drop_pools, inplace=True)
swimmingpool_df.head

#The Borough column needs to be updated to (B=Brooklyn, X=Bronx, M=Manhattan, Q=Queens,R=Staten Island(Richmond))
borough_mapping = {
    'B': 'Brooklyn',
    'X': 'Bronx',
    'M': 'Manhattan',
    'Q': 'Queens',
    'R': 'Staten Island'
}

swimmingpool_df['BOROUGH'] = swimmingpool_df['BOROUGH'].replace(borough_mapping)

#checking for null values
null_values = swimmingpool_df.isnull().sum()
null_values

swimmingpool_df = swimmingpool_df.drop_duplicates()

In [21]:
#Check the museums dataset for null values, clean if needed. 
museum_df
museum_df.columns

#Dropping Columns that are not needed for visualization
columns_to_drop_museums = ['the_geom', 'TEL', 'URL', 'ADRESS1', 'ADDRESS2', 'CITY']
museum_df.drop(columns=columns_to_drop_museums, inplace=True)

null_values = museum_df.isnull().sum()
null_values

NAME    0
ZIP     0
dtype: int64

In [22]:
#Check the farmers markets dataset for null values, clean if needed. 
markets_df.columns

#Dropping Columns that are not needed for visualization
columns_to_drop_markets = ['Street Address', 'Community District', ' Cooking Demonstrations', 'Latitude', 'Longitude', 'Days of Operation', 'Hours of Operations', 'Season Begin', 'Season End', 'Accepts EBT', 'Distributes Health Bucks?', 'Open Year-Round', 'Location Point']
markets_df.drop(columns=columns_to_drop_markets, inplace=True)
markets_df.head

#Check for Null values if any
null_values = markets_df.isnull().sum()
print(null_values)

Borough        0
Market Name    0
Zip Code       0
dtype: int64

In [23]:
#Check the theatres dataset for null values, clean if needed. 
theatres_df.columns

#Dropping Columns that are not needed for visualization
columns_to_drop_theatres = ['the_geom', 'TEL', 'URL', 'ADDRESS1', 'ADDRES2', 'CITY']
theatres_df.drop(columns=columns_to_drop_theatres, inplace=True)
print (theatres_df.head)

##Check for Null values if any
null_values = markets_df.isnull().sum()
print(null_values)

<bound method NDFrame.head of                       NAME    ZIP
0      45th Street Theater  10036
1      47th Street Theater  10036
2                    59E59  10022
3            Acorn Theater  10036
4    Al Hirschfeld Theater  10036
..                     ...    ...
112       Westside Theater  10036
113          Wings Theatre  10014
114  Winter Garden Theatre  10019
115           York Theatre  10022
116      Delacorte Theater      0

[117 rows x 2 columns]>
Borough        0
Market Name    0
Zip Code       0
dtype: int64

In [24]:
#Check the beach dataset for null values, clean if needed. 
beaches_df.head

#Drop Columns 
columns_to_drop_beach = ['the_geom', 'SYSTEM', 'GISPROPNUM', 'SHAPE_STAr', 'SHAPE_STLe']
beaches_df.drop(columns=columns_to_drop_beach, inplace=True)
beaches_df.head

#The Borough column needs to be updated to (B=Brooklyn, X=Bronx, M=Manhattan, Q=Queens,R=Staten Island(Richmond))
borough_mapping = {
    'B': 'Brooklyn',
    'X': 'Bronx',
    'M': 'Manhattan',
    'Q': 'Queens',
    'R': 'Staten Island'
}

beaches_df['BOROUGH'] = beaches_df['BOROUGH'].replace(borough_mapping)
beaches_df

#Since there are many duplicates, drop the duplicates to find just the unique combinations
unique_beaches_df = beaches_df.drop_duplicates()
unique_beaches_df

print (unique_beaches_df)

#Check for Null Values in the beach dataset
null_values = beaches_df.isnull().sum()
null_values

           BOROUGH               NAME
0           Queens     Rockaway Beach
92        Brooklyn       Coney Island
127          Bronx      Orchard Beach
128       Brooklyn    Manhattan Beach
156  Staten Island  Cedar Grove Beach
157  Staten Island      Midland Beach
158  Staten Island        South Beach
166  Staten Island  Wolfes Pond Beach

BOROUGH    0
NAME       0
dtype: int64

In [25]:
#Review Athletics Facitilies dataset to see what all datacleaning is needed
athleticfacilities_df

#Creating the subset DataFrame FOR Just the Sports and athletic facities
subset_df = athleticfacilities_df[['ADULT_BASEBALL', 'ADULT_FOOTBALL', 'ADULT_SOFTBALL', 'BASKETBALL', 'BOCCE', 'CRICKET', 'FLAGFOOTBALL', 'FRISBEE', 'HANDBALL', 'HOCKEY', 'KICKBALL', 'LACROSSE', 'LL_BASEB_12ANDUNDER', 'LL_BASEB_13ANDOLDER', 'LL_SOFTBALL', 'NETBALL', 'NONREGULATION_SOCCER', 'REGULATION_SOCCER', 'RUGBY', 'TENNIS', 'T_BALL', 'VOLLEYBALL', 'WHEELCHAIRFOOTBALL', 'YOUTH_FOOTBALL', 'ZIPCODE', 'BOROUGH']]
subset_df

#Grouping the number of athletic facities by Borough (GroupBy Boroughs, Count the True in the Athletic Feilds)
grouped_df_brgh = subset_df.groupby('BOROUGH').sum()
grouped_df_brgh.reset_index(inplace=True)

#dropping Zipcode column here (since counting boroughs)
grouped_df_brgh.drop(columns=['ZIPCODE'], inplace=True)

#The Borough column in 'grouped_df_brgh' needs to be updated to (B=Brooklyn, X=Bronx, M=Manhattan, Q=Queens,R=Staten Island(Richmond))
borough_mapping = {
    'B': 'Brooklyn',
    'X': 'Bronx',
    'M': 'Manhattan',
    'Q': 'Queens',
    'R': 'Staten Island'
}

grouped_df_brgh['BOROUGH'] = grouped_df_brgh['BOROUGH'].replace(borough_mapping)
grouped_df_brgh #this is essentially a dataset of the frequency of each sport or game type

,BOROUGH,ADULT_BASEBALL,ADULT_FOOTBALL,ADULT_SOFTBALL,BASKETBALL,BOCCE,CRICKET,FLAGFOOTBALL,FRISBEE,HANDBALL,...,LL_SOFTBALL,NETBALL,NONREGULATION_SOCCER,REGULATION_SOCCER,RUGBY,TENNIS,T_BALL,VOLLEYBALL,WHEELCHAIRFOOTBALL,YOUTH_FOOTBALL
0,Brooklyn,44,115,165,534,17,25,121,110,695,...,210,14,164,39,63,153,101,22,26,139
1,Manhattan,50,27,127,272,1,7,1,19,250,...,126,1,88,50,17,122,59,54,0,42
2,Queens,86,18,172,385,12,33,12,4,622,...,204,0,60,26,2,224,35,25,1,25
3,Staten Island,6,8,30,69,8,1,12,7,50,...,38,0,15,7,2,26,3,2,0,17
4,Bronx,36,12,72,236,12,16,13,2,343,...,94,0,42,25,2,98,10,8,0,16

### Utilities datasets

In [26]:
#Check the electricity consumption and cost dataset for null values, clean if needed. 
electricity_df.head

#Grouping the data by 'Borough' and calculating the average of 'Current Charges' and 'Other charges'
average_electricity_charges = electricity_df.groupby('Borough')[['Current Charges', 'Other charges']].mean()

#Reset the index to have 'Borough' as a column again
average_electricity_charges.reset_index(inplace=True)
average_electricity_charges

#Check the cooking gasconsumption and cost locations dataset for null values, clean if needed. 
cookinggas_df.head

#Grouping the data by 'Borough' and calculating the average of 'Current Charges' 
average_charges_cookinggas_df = cookinggas_df.groupby('Borough')[['Current Charges']].mean()

#Reset the index to have 'Borough' as a column again
average_charges_cookinggas_df.reset_index(inplace=True)

average_charges_cookinggas_df


#For average_charges_cookinggas_df and average_electricity_charges, they both can be combined
##first rename the columns for clarity,
average_charges_cookinggas_df = average_charges_cookinggas_df.rename(
    columns={'Current Charges': 'Average_Cooking_Gas_Charges'}
)
average_electricity_charges = average_electricity_charges.rename(
    columns={'Current Charges': 'Average_Electricity_Charges'}
)

#then merge the dataframes such that it shows the average utility costs for each borough
average_utility_charges = pd.merge(
    average_electricity_charges,
    average_charges_cookinggas_df,
    on='Borough',
    how='outer'
)

# Create a mask where only rows with 'Borough' not equal to 'NON DEVELOPMENT FACILITY' are True
mask = average_utility_charges['Borough'] != 'NON DEVELOPMENT FACILITY'

# Apply the mask to the DataFrame to filter out the unwanted rows
average_utility_charges = average_utility_charges[mask]

#print output
average_utility_charges

,Borough,Average_Electricity_Charges,Other charges,Average_Cooking_Gas_Charges
0,BRONX,4877.795864,2232.539056,235.210667
1,BROOKLYN,3490.012865,1563.688601,139.817673
2,FHA,43.606214,34.000101,6.928506
3,MANHATTAN,4882.858203,2233.868626,246.002440
5,QUEENS,3379.769238,1530.277372,151.697575
6,STATEN ISLAND,15670.242525,6821.951791,184.456653

In [27]:
#Check the wifi hotspot locations dataset for null values, clean if needed. 
wifi_hotspot_df.columns

#Renaming the 'Postcode' column to 'Zipcode'
wifi_hotspot_df = wifi_hotspot_df.rename(columns={'Postcode': 'Zipcode'})

# Group by 'Postcode' and count the frequency of WiFi hotspots
wifi_frequency_by_zipcode = wifi_hotspot_df.groupby('Zipcode').size().reset_index(name='Frequency')
wifi_frequency_by_zipcode

     Zipcode  Frequency
0      10001         65
1      10002         24
2      10003         82
3      10004         51
4      10005          9
..       ...        ...
167    11436          5
168    11691         11
169    11692          3
170    11693         12
171    11694         11

[172 rows x 2 columns]

In [28]:
#Check the grocery store locations dataset for null values, clean if needed. 
grocery_stores.columns

#Dropping Columns that are not needed for visualization
columns_to_drop_stores = ['Street Address', 'Address', 'Year Awarded', 'Program \nWave', 'Latitude', 'Longitude', 'Community Board', 'Council District', 'BIN', 'BBL','Census Tract (2020)', 'Neighborhood Tabulation Area (NTA) (2020)' ]
grocery_stores.drop(columns=columns_to_drop_stores, inplace=True)
grocery_stores

                        Store Name   Borough  Zip \nCode
0               Rivas Deli Grocery     Bronx       10458
1                           C-Town     Bronx       10460
2             La India Mini Market     Bronx       10460
3                     Los Hermanos     Bronx       10460
4         Price Choice Food Market     Bronx       10460
..                             ...       ...         ...
670               Piggy  Meat Corp  Brooklyn       11221
671  Natural And Organic Deli Corp  Brooklyn       11221
672  Keita West African Market Inc  Brooklyn       11221
673     Organic Fresh Market Corps  Brooklyn       11221
674            City Star Deli Corp  Brooklyn       11221

[675 rows x 3 columns]

In [29]:
#Check the firehouse locations dataset for null values, clean if needed. 
firehouselocations_df

# Renaming the 'Postcode' column to 'Zipcode'
firehouselocations_df = firehouselocations_df.rename(columns={'Postcode': 'Zipcode'})

#Counting the frequency of fire stations in each postcode
fire_stations_per_zipcode = firehouselocations_df['Zipcode'].value_counts()
print(fire_stations_per_zipcode)

#View what all columns have null values 
null_values = firehouselocations_df.isnull().sum()
print(null_values)

firehouselocations_df = firehouselocations_df[['FacilityName', 'Borough', 'Zipcode']]
firehouselocations_df.head

Zipcode
10457    5
11211    4
11221    4
11233    4
10304    4
        ..
11232    1
10463    1
10471    1
10464    1
10309    1
Name: count, Length: 145, dtype: int64
FacilityName          0
FacilityAddress       0
Borough               0
Zipcode               0
Latitude              0
Longitude             0
Community Board       0
Community Council     0
Census Tract          0
BIN                   0
BBL                   0
NTA                   0
dtype: int64

<bound method NDFrame.head of                                           FacilityName        Borough  Zipcode
0                                   Engine 4/Ladder 15      Manhattan    10005
1                                             Engine 6      Manhattan    10038
2    Manhattan Borough Command/Battalion 1/Engine 7...      Manhattan    10007
3                                             Ladder 8      Manhattan    10013
4                                    Engine 9/Ladder 6      Manhattan    10002
..                                                 ...            ...      ...
214                               Engine 167/Ladder 87  Staten Island    10312
215                               Engine 164/Ladder 84  Staten Island    10312
216                               Engine 151/Ladder 76  Staten Island    10307
217                                         Engine 168  Staten Island    10309
218                                           Marine 9  Staten Island    10304

[219 rows x 3 columns]>

### Upcoming projects in New York data

In [30]:
#Check the active projects under construction for null values, clean if needed. 
projects_under_constr_df.columns

#Dropping Columns that are not needed for visualization
columns_to_drop_uc_projects = ['Geographical District', 'BoroughCode', 'Construction Award', 'Project type', 'Building ID', 'Building Address', 'City', 'Latitude', 'Longitude', 'Community Board', 'Council District', 'BIN', 'BBL', 'Census Tract (2020)', 'Neighborhood Tabulation Area (NTA) (2020)',  'Location 1' , 'Data As Of' ]
projects_under_constr_df.drop(columns=columns_to_drop_uc_projects, inplace=True)

#Drop rows with null values
projects_under_constr_df = projects_under_constr_df.dropna()
projects_under_constr_df

,School Name,Project Description,Postcode,Borough
3,P.S. 95 - BRONX,DEFECTIVE MASONRY/PARAPETS,10463.0,BRONX
4,P.S. 19 - QUEENS,Addition,11368.0,QUEENS
5,P.S. 138 - QUEENS,EXTERIOR MASONRY / FLOOD ELIMINATION / PARAPET...,11204.0,QUEENS
6,P.S. 37 - BRONX,PA SYSTEM REPLACEMENT,11204.0,BRONX
7,P.S. 5 - STATEN ISLAND,Demo,10312.0,STATEN IS
...,...,...,...,...
13230,THOMAS A. EDISON HS - Q,FY17 RESO A ROOM CONVERSIONS/PARTITIONING,11432.0,QUEENS
13231,P.S. 214 - BRONX,ELECTRICAL WORK FOR A/C INITIATIVE / LL26 CODE...,10301.0,BRONX
13232,P.S. 150 - QUEENS,EXTERIOR MASONRY / FLOOD ELIMINATION / PARAPET...,10301.0,QUEENS
13233,FORT HAMILTON HS - K,IP DIGITAL VIDEO SURVEILLANCE SYSTEM,11209.0,BROOKLYN
13234,ADULT AND CONTINUING EDUCATION,EXTERIOR MASONRY / FLOOD ELIMINATION / LOW VOL...,10467.0,BROOKLYN

## Connect to SQL Database

In [31]:
#Create a Database Connection
from sqlalchemy import create_engine, text
import pandas as pd
import psycopg2


database_url = "postgresql://postgres:123@localhost:5432/nyc_projectmd"
engine = create_engine(database_url)
# Establish a connection
connection = engine.connect()

## Creating all tables that were transformed in SQL

In [32]:
createCmd = """


CREATE TABLE IF NOT EXISTS "Borough_masterdf" (
    "borough_id" INTEGER PRIMARY KEY,
    "borough" VARCHAR(50)
);

CREATE TABLE IF NOT EXISTS all_homes_by_bedrooms (
    zipcode VARCHAR(10) NOT NULL,
    bedrooms INT NOT NULL,
    "2024-02" VARCHAR(150) NOT NULL,
    "2024-01" VARCHAR(150) NOT NULL,
    "2023-12" VARCHAR(150) NOT NULL,
    "2023-11" VARCHAR(150) NOT NULL,
    "2023-10" VARCHAR(150) NOT NULL,
    "2023-09" VARCHAR(150) NOT NULL,
    PRIMARY KEY (zipcode, bedrooms)
);

CREATE TABLE IF NOT EXISTS all_homes_forecast (
    zipcode VARCHAR(10) NOT NULL,
    basedate DATE NOT NULL,
    "2024-03" VARCHAR(150) NOT NULL,
    "2024-05" VARCHAR(150) NOT NULL,
    "2025-02" VARCHAR(150) NOT NULL,
    PRIMARY KEY (zipcode)
);

CREATE TABLE IF NOT EXISTS all_homes_observed_rent (
    zipcode VARCHAR(10) NOT NULL,
    "2024-02" VARCHAR(150) NOT NULL,
    "2024-01" VARCHAR(150) NOT NULL,
    "2023-12" VARCHAR(150) NOT NULL,
    "2023-11" VARCHAR(150) NOT NULL,
    "2023-10" VARCHAR(150) NOT NULL,
    "2023-09" VARCHAR(150) NOT NULL,
    PRIMARY KEY (zipcode)
);

CREATE TABLE IF NOT EXISTS all_homes_final (
    zipcode VARCHAR(10) NOT NULL,
    "2024-02" VARCHAR(150) NOT NULL,
    "2024-01" VARCHAR(150) NOT NULL,
    "2023-12" VARCHAR(150) NOT NULL,
    "2023-11" VARCHAR(150) NOT NULL,
    "2023-10" VARCHAR(150) NOT NULL,
    "2023-09" VARCHAR(150) NOT NULL,
    PRIMARY KEY (zipcode)
);

CREATE TABLE IF NOT EXISTS final_crime_statistics (
    zipcode VARCHAR(10),
    average_crime_data FLOAT,
    borough VARCHAR(150),
    borough_id INTEGER,
    FOREIGN KEY (borough_id) REFERENCES "Borough_masterdf" (borough_id)
);

CREATE TABLE IF NOT EXISTS geography (
    borough TEXT PRIMARY KEY,
    borough_id INTEGER,
    FOREIGN KEY (borough_id) REFERENCES "Borough_masterdf" (borough_id)
);

CREATE TABLE IF NOT EXISTS demographics (
    borough TEXT PRIMARY KEY,
    total_population INT,
    men INT,
    women INT,
    borough_id INTEGER,
    FOREIGN KEY (borough) REFERENCES geography (borough),
    FOREIGN KEY (borough_id) REFERENCES "Borough_masterdf" (borough_id)
);

CREATE TABLE IF NOT EXISTS race_ethnicity (
    borough TEXT PRIMARY KEY,
    total_hispanic FLOAT,
    total_white FLOAT,
    total_black FLOAT,
    total_native FLOAT,
    total_asian FLOAT,
    borough_id INTEGER,
    FOREIGN KEY (borough) REFERENCES geography (borough),
    FOREIGN KEY (borough_id) REFERENCES "Borough_masterdf" (borough_id)
);

CREATE TABLE IF NOT EXISTS economic_indicators (
    borough TEXT PRIMARY KEY,
    avg_income FLOAT,
    total_employed INT,
    total_unemployed INT,
    borough_id INTEGER,
    FOREIGN KEY (borough) REFERENCES geography (borough),
    FOREIGN KEY (borough_id) REFERENCES "Borough_masterdf" (borough_id)
);

CREATE TABLE IF NOT EXISTS high_schools (
    zip_code VARCHAR(150) NOT NULL,
    borough VARCHAR(150) NOT NULL,
    school_name VARCHAR(150) NOT NULL,
    school_id SERIAL PRIMARY KEY,
    borough_id INTEGER,
    FOREIGN KEY (borough_id) REFERENCES "Borough_masterdf" (borough_id)
);

CREATE TABLE IF NOT EXISTS library (
    library_id SERIAL PRIMARY KEY,
    name VARCHAR(255) NOT NULL,
    zipcode VARCHAR(10) NOT NULL,
    borough VARCHAR(150) NOT NULL,
    borough_id INTEGER,
    FOREIGN KEY (borough_id) REFERENCES "Borough_masterdf" (borough_id)
);

CREATE TABLE IF NOT EXISTS subway_stations (
    id SERIAL PRIMARY KEY,
    borough VARCHAR(150),
    station_name VARCHAR(150) NOT NULL,
    line VARCHAR(150),
    ada_accessible BOOLEAN,
    borough_id INTEGER,
    FOREIGN KEY (borough_id) REFERENCES "Borough_masterdf" (borough_id)
);

CREATE TABLE IF NOT EXISTS nyc_borough_transportation (
    id SERIAL PRIMARY KEY,
    borough VARCHAR(150),
    drive NUMERIC,
    carpool NUMERIC,
    transit NUMERIC,
    walk NUMERIC,
    other_transp NUMERIC,
    work_at_home NUMERIC,
    mean_commute NUMERIC,
    borough_id INTEGER,
    FOREIGN KEY (borough_id) REFERENCES "Borough_masterdf" (borough_id)
);

CREATE TABLE IF NOT EXISTS hospital_stage (
    Facility_Type VARCHAR(150),
    borough VARCHAR(50),
    facility_name VARCHAR(150),
    Cross_Streets TEXT,
    Phone VARCHAR(18),
    Location_1 TEXT,
    borough_id INTEGER,
    FOREIGN KEY (borough_id) REFERENCES "Borough_masterdf" (borough_id)
);

CREATE TABLE nyc_parksdata (
    acres FLOAT,
    address VARCHAR(150),
    borough VARCHAR(50),
    class VARCHAR(50),
    zipcode VARCHAR(50),
    borough_id INTEGER,
    FOREIGN KEY (borough_id) REFERENCES "Borough_masterdf" (borough_id)
);

BEGIN;

CREATE TABLE IF NOT EXISTS "Latitude_Longitude_Zip" (
    "zipcode" VARCHAR(10) PRIMARY KEY,
    "latitude" NUMERIC(10, 6),
    "longitude" NUMERIC(10, 6)
);

CREATE TABLE IF NOT EXISTS "Borough_id_Zip" (
    "borough" VARCHAR(100),
    "zipcode" VARCHAR(10),
    "borough_id" INTEGER,
    PRIMARY KEY ("zipcode"),
    FOREIGN KEY ("borough_id") REFERENCES "Borough_masterdf" ("borough_id")
);

CREATE TABLE IF NOT EXISTS "restaurants" (
    "restaurants_name" VARCHAR(255),
    "rating" NUMERIC(2, 1),
    "zipcode" VARCHAR(10),
    PRIMARY KEY ("restaurants_name", "zipcode")
);

CREATE TABLE IF NOT EXISTS "museums" (
    "museum_name" VARCHAR(255),
    "zipcode" VARCHAR(10),
    PRIMARY KEY ("museum_name", "zipcode")
);

CREATE TABLE IF NOT EXISTS "farmers_markets" (
    "borough" VARCHAR(100),
    "market_name" VARCHAR(255),
    "zipcode" VARCHAR(10),
    "borough_id" INTEGER,
    PRIMARY KEY ("market_name", "zipcode"),
    FOREIGN KEY ("borough_id") REFERENCES "Borough_masterdf" ("borough_id")
);

CREATE TABLE IF NOT EXISTS "swimming_pools" (
    "borough" VARCHAR(100),
    "swimming_pool_name" VARCHAR(255),
    "borough_id" INTEGER,
    PRIMARY KEY ("swimming_pool_name", "borough"),
    FOREIGN KEY ("borough_id") REFERENCES "Borough_masterdf" ("borough_id")
);

CREATE TABLE IF NOT EXISTS "theatres" (
    "theatre_name" VARCHAR(255),
    "zipcode" VARCHAR(10),
    PRIMARY KEY ("theatre_name", "zipcode")
);

CREATE TABLE IF NOT EXISTS "beaches" (
    "borough" VARCHAR(100),
    "beach_name" VARCHAR(255),
    "borough_id" INTEGER,
    PRIMARY KEY ("beach_name", "borough"),
    FOREIGN KEY ("borough_id") REFERENCES "Borough_masterdf" ("borough_id")
);

CREATE TABLE IF NOT EXISTS "athletic_facilities" (
    "borough" VARCHAR(100),
    "borough_id" INTEGER,
    "ADULT_BASEBALL" BOOLEAN,
    "ADULT_FOOTBALL" BOOLEAN,
    "ADULT_SOFTBALL" BOOLEAN,
    "BASKETBALL" BOOLEAN,
    "BOCCE" BOOLEAN,
    "CRICKET" BOOLEAN,
    "FLAGFOOTBALL" BOOLEAN,
    "FRISBEE" BOOLEAN,
    "HANDBALL" BOOLEAN,
    "HOCKEY" BOOLEAN,
    "KICKBALL" BOOLEAN,
    "LACROSSE" BOOLEAN,
    "LL_BASEB_12ANDUNDER" BOOLEAN,
    "LL_BASEB_13ANDOLDER" BOOLEAN,
    "LL_SOFTBALL" BOOLEAN,
    "NETBALL" BOOLEAN,
    "NONREGULATION_SOCCER" BOOLEAN,
    "REGULATION_SOCCER" BOOLEAN,
    "RUGBY" BOOLEAN,
    "TENNIS" BOOLEAN,
    "T_BALL" BOOLEAN,
    "VOLLEYBALL" BOOLEAN,
    "WHEELCHAIRFOOTBALL" BOOLEAN,
    "YOUTH_FOOTBALL" BOOLEAN,
    PRIMARY KEY ("borough"),
    FOREIGN KEY ("borough_id") REFERENCES "Borough_masterdf" ("borough_id")
);

CREATE TABLE IF NOT EXISTS "average_utility_charges" (
    "borough" VARCHAR(100),
    "borough_id" INTEGER,
    "average_electricity_charges" NUMERIC(9, 2),
    "other_charges" NUMERIC(9, 2),
    "average_cooking_gas_charges" NUMERIC(9, 2),
    PRIMARY KEY ("borough"),
    FOREIGN KEY ("borough_id") REFERENCES "Borough_masterdf" ("borough_id")
);

CREATE TABLE IF NOT EXISTS "wifi_frequency" (
    "zipcode" VARCHAR(10),
    "Frequency" INTEGER,
    PRIMARY KEY ("zipcode")
);

CREATE TABLE IF NOT EXISTS "grocery_stores" (
    "store_name" VARCHAR(255),
    "borough" VARCHAR(100),
    "zipcode" VARCHAR(10),
    "borough_id" INTEGER,
    PRIMARY KEY ("store_name", "zipcode"),
    FOREIGN KEY ("borough_id") REFERENCES "Borough_masterdf" ("borough_id")
);

CREATE TABLE IF NOT EXISTS "fire_stations" (
    "facility_name" VARCHAR(255),
    "borough" VARCHAR(100),
    "zipcode" VARCHAR(10),
);

CREATE TABLE IF NOT EXISTS "projects_under_construction" (
    "school_name" VARCHAR(255),
    "project_description" TEXT,
    "postcode" VARCHAR(10),
    borough_id INTEGER,
    "borough" VARCHAR(100),
    PRIMARY KEY ("school_name", "postcode"),
    FOREIGN KEY (borough_id) REFERENCES "Borough_masterdf" (borough_id)
)
"""

## LOADING DATA TO POSTGRESQL DB

### With the connection established, using the to_sql method to import all the dataframes

In [33]:
#Demographics
boroughs_data.to_sql('geography', engine, if_exists='replace', index=False)
demographics_agg.to_sql('demographics', engine, if_exists='replace', index=False)
race_ethnicity_agg.to_sql('race_ethnicity', engine, if_exists='replace', index=False)
economic_indicators_agg.to_sql('economic_indicators', engine, if_exists='replace', index=False)

#Education and Transportation 
high_schools.to_sql('high_schools', engine, if_exists='replace', index=False)
library_df.to_sql('library', engine, if_exists='replace', index=False)
subway_df.to_sql('subway_stations', engine, if_exists='replace', index=False)
borough_transportation.to_sql('nyc_borough_transportation', engine, if_exists='replace', index=False)
borough_daily_avg.to_sql('borough_traffic_averages', engine, if_exists='replace', index=False)

#Housing Data
all_homes_by_bedrooms.to_sql('all_homes_by_bedrooms', engine, if_exists='replace', index=False)
all_homes_final.to_sql('all_homes_final', engine, if_exists='replace', index=False)
all_homes_forecast.to_sql('all_homes_forecast', engine, if_exists='replace', index=False)
all_homes_observed_rent.to_sql('all_homes_observed_rent', engine, if_exists='replace', index=False)

#Hospitals and Parks
hospitals_df.to_sql('hospital_stage ', engine, if_exists='replace', index=False)
final_parks.to_sql('nyc_parksdata', engine, if_exists='replace', index=False)

#Entertainment
restaurants_df.to_sql('restaurants', engine, if_exists='replace', index=False)
museum_df.to_sql('museums', engine, if_exists='replace', index=False)
markets_df.to_sql('farmers_markets', engine, if_exists='replace', index=False)
swimmingpool_df.to_sql('swimming_pools', engine, if_exists='replace', index=False)
theatres_df.to_sql('theatres', engine, if_exists='replace', index=False)
unique_beaches_df.to_sql('beaches', engine, if_exists='replace', index=False)
grouped_df_brgh.to_sql('athletic_facilities', engine, if_exists='replace', index=False)

#Utilities
average_utility_charges.to_sql('average_utility_charges', engine, if_exists='replace', index=False)
wifi_frequency_by_zipcode.to_sql('wifi_frequency', engine, if_exists='replace', index=False)
unique_beaches_df.to_sql('beaches', engine, if_exists='replace', index=False)
grocery_stores.to_sql('grocery_stores', engine, if_exists='replace', index=False)
firehouselocations_df.to_sql('fire_stations', engine, if_exists='replace', index=False)

#Projects under construction
projects_under_constr_df.to_sql('projects_under_construction', engine, if_exists='replace', index=False)

430

## ETL and ELT process Ends here.